"""
Ваша задача - расшифровать сообщение используя азбуку Морзе.
В шифровке будет использован 1 пробел между буквами одого слова и 3 пробела между отдельными словами.
Если расшифрованный текст начинается со слова, первая буква этого слова должна быть заглавной.
 Входные данные: Секретное сообщение
Выходные данные: Расшифрованный текст
"""
MORSE = {'.-': 'a', '-...': 'b', '-.-.': 'c',
         '-..': 'd', '.': 'e', '..-.': 'f',
         '--.': 'g', '....': 'h', '..': 'i',
         '.---': 'j', '-.-': 'k', '.-..': 'l',
         '--': 'm', '-.': 'n', '---': 'o',
         '.--.': 'p', '--.-': 'q', '.-.': 'r',
         '...': 's', '-': 't', '..-': 'u',
         '...-': 'v', '.--': 'w', '-..-': 'x',
         '-.--': 'y', '--..': 'z', '-----': '0',
         '.----': '1', '..---': '2', '...--': '3',
         '....-': '4', '.....': '5', '-....': '6',
         '--...': '7', '---..': '8', '----.': '9'
         }


def morse_decoder(code):
    code_list = code.split(" ")
    result = ""
    for i in code_list:
        if MORSE.get(i) is None:
            if result[-1] != " ":
                result += " "
        else:
            result += MORSE.get(i)
    result = "".join(result)
    return result.capitalize()


print(morse_decoder("... --- -- .   - . -..- -") == "Some text")
print(morse_decoder("..--- ----- .---- ---..") == "2018")
print(morse_decoder(".. -   .-- .- ...   .-   --. --- --- -..   -.. .- -.--")
      == "It was a good day")
