"""
Ваша задача - зашифровать текстовое сообщение используя азбуку Морзе. Исходный текст будет состоять только из букв (в верхнем и нижнем регистре), чисел и пробелов. Специальные символы использоваться не будут ('&', '?', '#' и т.п.)
Используйте 1 пробел между буквами одого слова и 3 пробела между отдельными словами.
Входные данные: Секретное сообщение как строка
Выходные данные: Зашифрованный текст
"""
MORSE = {'a': '.-', 'b': '-...', 'c': '-.-.',
         'd': '-..', 'e': '.', 'f': '..-.',
         'g': '--.', 'h': '....', 'i': '..',
         'j': '.---', 'k': '-.-', 'l': '.-..',
         'm': '--', 'n': '-.', 'o': '---',
         'p': '.--.', 'q': '--.-', 'r': '.-.',
         's': '...', 't': '-', 'u': '..-',
         'v': '...-', 'w': '.--', 'x': '-..-',
         'y': '-.--', 'z': '--..', '0': '-----',
         '1': '.----', '2': '..---', '3': '...--',
         '4': '....-', '5': '.....', '6': '-....',
         '7': '--...', '8': '---..', '9': '----.'
         }


def morse_encoder(text):
    text = text.lower()
    result = ''
    for i in text:
        if MORSE.get(i) is None:
            result += '  '
        else:
            result += MORSE.get(i)
            result += ' '
    return result.rstrip()


print(morse_encoder("some text") == "... --- -- .   - . -..- -")
print(morse_encoder("some text") == "... --- -- .   - . -..- -")
print(morse_encoder("2018") == "..--- ----- .---- ---..")
print(morse_encoder("It was a good day") ==
      ".. -   .-- .- ...   .-   --. --- --- -..   -.. .- -.--")
